GenevGitHub/Genev_CC2652R7_Firmware/Application/simple_peripheral.c
  // Create an RTOS queue for message from profile to be sent to app.
  appMsgQueueHandle = Util_constructQueue(&appMsgQueue);

  // Create one-shot clock for internal periodic events.
  Util_constructClock(&clkPeriodic, SimplePeripheral_clockHandler,
                      SP_PERIODIC_EVT_PERIOD, 0, false, (UArg)&argPeriodic);

  // Set the Device Name characteristic in the GAP GATT Service
  // For more information, see the section in the User's Guide:
  // http://software-dl.ti.com/lprf/ble5stack-latest/
  GGS_SetParameter(GGS_DEVICE_NAME_ATT, GAP_DEVICE_NAME_LEN, attDeviceName);

  // Configure GAP
  {
    uint16_t paramUpdateDecision = DEFAULT_PARAM_UPDATE_REQ_DECISION;

    // Pass all parameter update requests to the app for it to decide
    GAP_SetParamValue(GAP_PARAM_LINK_UPDATE_DECISION, paramUpdateDecision);
  }

  // Setup the GAP Bond Manager. For more information see the GAP Bond Manager
  // section in the User's Guide
  setBondManagerParameters();

/*********************  Added Services  ***************************************/
  // Initialize GATT attributes
  GGS_AddService(GAP_SERVICE);                  // GAP GATT Service
  GATTServApp_AddService(GATT_ALL_SERVICES);    // GATT Service
  DevInfo_AddService();                         // Device Information Service

  /******* Initialize Profiles and Profile Characteristic Value pointer registers *********/
    Dashboard_profile_init();
    Battery_profile_init();
    Controller_profile_init();
    profile_charVal_init();

    ptr_sp_profileCharVal = profile_charVal_profileCharValRegister();

  /******************* end pointer registers **************/

/*********************  Added Services  ***************************************/
    Dashboard_AddService();                       // Dashboard Profile Service
    Battery_AddService();                         // Battery Profile Service
    Controller_AddService();                      // Controller Profile Service

    /********** send and register the pointer of sp_opcode to multi_purpose_button.c  *******/
    ptr_GAPflag = mpb_registeropcode(&sp_opcode, &sp_advertiseFlag);    // obtain pointer to GAPflag from mpb.c
    gpt_registeropcode(&sp_opcode, &sp_advertiseFlag);                  // register sp_code and sp_advertiseFlag at led display
    led_display_opcodeRegister(&sp_opcode);                             // register sp_code at led display

  /*****************  Setup initial Profile Characteristic Values  ************************/
  // For more information, see the GATT and GATTServApp sections in the User's Guide:
  // http://software-dl.ti.com/lprf/ble5stack-latest/
  {
      /******* only if the initial characteristic values need changing  *********/
      uint32_t    ADCounter_init_val = 0;
      uint16_t    power_on_time_init_val = 60;
      uint8_t     error_code_init_val = 0;
      uint8_t     speed_mode_init_val = 0;
      uint8_t     light_mode_init_val = 2;
      uint8_t     light_status_init_val = 0;

      /*********************** for demo purposes only **************************/
  //    uint8_t db_charValue2[DASHBOARD_LIGHT_STATUS_LEN] = {1};
  //    uint8_t db_charValue3[DASHBOARD_LIGHT_MODE_LEN] = {1};
  //    Dashboard_SetParameter(DASHBOARD_LIGHT_STATUS, DASHBOARD_LIGHT_STATUS_LEN,
  //                           db_charValue2);
  //    Dashboard_SetParameter(DASHBOARD_LIGHT_MODE, DASHBOARD_LIGHT_MODE_LEN,
  //                           &db_charValue3);
      uint8 db_charValue4[DASHBOARD_POWER_ON_TIME_LEN] = {(power_on_time_init_val & 0xFF), ((power_on_time_init_val >> 8) & 0xFF)};
      Dashboard_SetParameter(DASHBOARD_POWER_ON_TIME, DASHBOARD_POWER_ON_TIME_LEN,
                             db_charValue4);
  }

  /************** Register callback with Dashboard profile, Battery profile, Controller profile ***************/

  Dashboard_RegisterAppCBs(&DashboardCBs);          // send pointer to DashboardCBs to dashboard profile
  Battery_RegisterAppCBs( &BatteryCBs );            // there is no characteristic that require callback
  Controller_RegisterAppCBs( &ControllerCBs );      // there is no characteristic that require callback

  // Start Bond Manager and register callback
//  VOID GAPBondMgr_Register(&SimplePeripheral_BondMgrCBs);     // what is this used for?  Harry, Please help check.

  // Register with GAP for HCI/Host messages. This is needed to receive HCI
  // events. For more information, see the HCI section in the User's Guide:
  // http://software-dl.ti.com/lprf/ble5stack-latest/
  GAP_RegisterForMsgs(selfEntity);

  // Register for GATT local events and ATT Responses pending for transmission
  GATT_RegisterForMsgs(selfEntity);

  // Set default values for Data Length Extension
  // Extended Data Length Feature is already enabled by default
  {
    // Set initial values to maximum, RX is set to max. by default(251 octets, 2120us)
    // Some brand smartphone is essentially needing 251/2120, so we set them here.
    #define APP_SUGGESTED_PDU_SIZE 251 //default is 27 octets(TX)
    #define APP_SUGGESTED_TX_TIME 2120 //default is 328us(TX)

    // This API is documented in hci.h
    // See the LE Data Length Extension section in the BLE5-Stack User's Guide for information on using this command:
    // http://software-dl.ti.com/lprf/ble5stack-latest/
    HCI_LE_WriteSuggestedDefaultDataLenCmd(APP_SUGGESTED_PDU_SIZE, APP_SUGGESTED_TX_TIME);
  }

  // Initialize GATT Client
  GATT_InitClient();

  // Initialize Connection List
  SimplePeripheral_clearConnListEntry(LINKDB_CONNHANDLE_ALL);

  BLE_LOG_INT_TIME(0, BLE_LOG_MODULE_APP, "APP : ---- call GAP_DeviceInit", GAP_PROFILE_PERIPHERAL);
  //Initialize GAP layer for Peripheral role and register to receive GAP events
  GAP_DeviceInit(GAP_PROFILE_PERIPHERAL, selfEntity, addrMode, &pRandomAddress);

  // Initialize array to store connection handle and RSSI values
  SimplePeripheral_initPHYRSSIArray();

#ifdef PTM_MODE
  // Intercept NPI RX events.
  NPITask_registerIncomingRXEventAppCB(simple_peripheral_handleNPIRxInterceptEvent, INTERCEPT);

  // Register for Command Status information
  HCI_TL_Init(NULL, (HCI_TL_CommandStatusCB_t) simple_peripheral_sendToNPI, NULL, selfEntity);

