GenevGitHub/Genev_CC2652R7_Firmware/Application/simple_peripheral.c
  // Register for Events
  HCI_TL_getCmdResponderID(ICall_getLocalMsgEntityId(ICALL_SERVICE_CLASS_BLE_MSG, selfEntity));

  // Inform Stack to Initialize PTM
  HCI_EXT_EnablePTMCmd();
#endif // PTM_MODE

}

/*********************************************************************
 * @fn      SimplePeripheral_taskFxn
 *
 * @brief   Application task entry point for the Simple Peripheral.
 *
 * @param   a0, a1 - not used.
 */
uint8_t         sp_initComplete_flag = GPT_INACTIVE;
static bool     *ptr_sp_POWER_ON;       // register for POWER_ON status
static sysFatalError_t *ptr_sysFatalError;
static uint8_t  *ptr_snvWriteFlag;

uint8_t     sp_counter = 0;
uint8_t     sp_i2cOpenStatus;
bStatus_t   check_enableStatus;       // for debugging purpose only
uint8_t     check_snvWriteFlag = 0;   // for debugging purpose only
static uint8_t     *ptr_sp_dashboardErrorCodeStatus;

static void SimplePeripheral_taskFxn(UArg a0, UArg a1)
{
  /*******   Initialize application   ********/
      gpt_InitComplFlagRegister(&sp_initComplete_flag);             // send pointer to sp_initComplet_flag to gpt.c
      pot_InitComplFlagRegister(&sp_initComplete_flag);

      ptrUDBuffer = snv_internal_setReadBuffer(&snv_internal_80);   // pass the pointer to snv_internal_80 to snv_internal and get the pointer to UDArray in return

      data_analytics_setReadBuffer(&snv_internal_80);               // pass the pointer to snv_internal_80 to data_analytics

      ptr_sp_POWER_ON = mpb_powerOnRegister();                      // call mpb_powerOnRegister and get the pointer to powerOn in return

      ptr_sysFatalError = UDHAL_sysFatalErrorRegister();            // call UDHAL to get pointer to sysFatalError

      led_display_advertiseFlagRegister(&sp_advertiseFlag);         // pass pointer to sp_advertiseFlag to led display

      ptr_snvWriteFlag = snvWriteFlageRegister();                   // call snvWriteFlagRegister to get pointer to snvWriteFlag

      ptr_sp_dashboardErrorCodeStatus = bat_dashboardErrorCodeStatusRegister(); // call bat_dashboardErrorCodeStatusRegister to get pointer to sp_dashboardErrorCodeStatus

      SimplePeripheral_init();

  /**************** Non-Volatile Storage via SNV *****************************/
  /* clear and set Buffer SNV_NV_ID80 for the first time */
      snv_status = osal_snv_read(SNV_NV_ID80, sizeof(snv_internal_80), (uint32_t *)snv_internal_80);
      // RESET NVS if the following conditions are not met
      if ((snv_internal_80[SNV_BUFFER_SIZE - 6] != RESETCODE01) && (snv_internal_80[SNV_BUFFER_SIZE - 5] != RESETCODE02))
      {
          //#ifdef RESET_NVS
          snv_internal_resetSNVdata();
          snv_status = osal_snv_write(SNV_NV_ID80, sizeof(snv_internal_80), ptrUDBuffer);
          //#endif // RESET_NVS
      }

  /****    reads from memory at SNV ID 80 and stores the read in buffer snv_internal    ****/
      snv_status = osal_snv_read(SNV_NV_ID80, sizeof(snv_internal_80), (uint32_t *)snv_internal_80);

  /**************** End Non-Volatile Storage via SNV *****************************/

    /**************************************************************************
     *  Initialize UDHAL (GPIO, I2C, ADC, UART)
     * return the status of I2C open
     * return 0 = I2C open failed
     * return 1 = I2c open successful
     *
     * UDHAL_init must be called before Hardware and Applications
     **************************************************************************/
      sp_i2cOpenStatus = UDHAL_init();

      /* Set up initial data values after reading from NVS memory  */
      brake_and_throttle_setSpeedMode(snv_internal_80[SNV_BUFFER_SIZE - 4]);   // set initial speedMode = snv_internal_80[28]
      pot_setDeviceUpTime(snv_internal_80[SNV_BUFFER_SIZE - 1]);    // read and set initial device uptime

      /********* motor_contol_init must be before data_analytics_init **********/
      STM32MCP_init();  // -> timer2_Start
      motor_control_init();

      /* led_display_init() must be before data_analytics_init(),
       * brake_and_throttle_init() and lights_init() */
      if (!(ptr_sysFatalError->I2Cfailure))
      {  /**** if i2c opened successfully, i.e. sp_sysFatalError = 0 (no error)  ****/
          /* Both ALS and led_display require successful open of i2c to function  */
          led_display_init();
      }

      data_analytics_init();
      brake_and_throttle_init();
      lights_init(sp_i2cOpenStatus, ptr_sysFatalError->UARTfailure, snv_internal_80[SNV_BUFFER_SIZE - 2]);       // set initial light Mode = snv_internal_80[30]

      /***** SYSTEM FATAL ERROR Check. Note SUCCESS = 0, FAILURE = 1 ******************/
      /*****            Must be activated after led_display_init()                   *****/
      if ((ptr_sysFatalError->UARTfailure) || (ptr_sysFatalError->I2Cfailure) ||
              (ptr_sysFatalError->PWMfailure) || (ptr_sysFatalError->ADCfailure) || (ptr_sysFatalError->Otherfailure))
      {
          led_display_ErrorPriority(SYS_FATAL_ERROR_PRIORITY);

          if (*ptr_sp_dashboardErrorCodeStatus > SYS_FATAL_ERROR_PRIORITY)
          {
              *ptr_sp_dashboardErrorCodeStatus = SYS_FATAL_ERROR_PRIORITY;
              ptr_charVal = (ptr_sp_profileCharVal->ptr_dash_charVal->ptr_dashErrorCode);
              profile_setCharVal(ptr_charVal, DASHBOARD_ERROR_CODE_LEN, SYS_FATAL_ERROR_CODE);
          }

          /**** system (CPU) fatal error has occurred
           *    Device should be instructed to reset / shut down
           *    Contact technical customer service if error persist
           *****/
          //      Go to error handling

      }

      /**************************************************************************************************************************
       *   Simple peripheral must finish initialization before GPT task functions initialize.
       *  sp_initComplete_flag is a flag for GPT that enables codes to execute only after SP completed initialization
       ****************************/
      sp_initComplete_flag = GPT_ACTIVE;

    /****** Simple Peripheral Application main loop  ******/
    for (;;)
    {
        uint32_t events;
        sp_counter++;

        // Waits for an event to be posted associated with the calling thread.
        // Note that an event associated with a thread is posted when a
        // message is queued to the message receive queue of the thread
        events = Event_pend(syncEvent, Event_Id_NONE, SP_ALL_EVENTS,
                            ICALL_TIMEOUT_FOREVER);

