GenevGitHub/Genev_CC2652R7_Firmware/Application/simple_peripheral.c
        /***** Handles BLE enable when user selects BLE on from MPB    *****/
        if( (sp_opcode == GAP_LINK_TERMINATED_EVENT) || (sp_opcode == GAP_DEVICE_INIT_DONE_EVENT) )
        {
            if (*ptr_GAPflag)
            {         // if BLE is not advertising, do the following
                if (!sp_advertiseFlag)             // if advertising request = 1, enable advertise
                {
                    check_enableStatus = GapAdv_enable(advHandleLegacy, GAP_ADV_ENABLE_OPTIONS_USE_DURATION , SP_ADVERTISING_TIMEOUT); //by_harry 2024_05_25
                    *ptr_GAPflag = 0;    // whenever advertising is enabled - set GAPflag to 0
                }
            }
        }


        if (events)
        {
              ICall_EntityID dest;
              ICall_ServiceEnum src;
              ICall_HciExtEvt *pMsg = NULL;

              // Fetch any available messages that might have been sent from the stack
              if (ICall_fetchServiceMsg(&src, &dest,
                                        (void **)&pMsg) == ICALL_ERRNO_SUCCESS)
              {
                    uint8 safeToDealloc = TRUE;

                    if ((src == ICALL_SERVICE_CLASS_BLE) && (dest == selfEntity))
                    {
                          ICall_Stack_Event *pEvt = (ICall_Stack_Event *)pMsg;

                          // Check for BLE stack events first
                          if (pEvt->signature != 0xffff)
                          {
                            // Process inter-task message
                            safeToDealloc = SimplePeripheral_processStackMsg((ICall_Hdr *)pMsg);
                          }
                    }

                    if (pMsg && safeToDealloc)
                    {
                      ICall_freeMsg(pMsg);
                    }
              }

              // If RTOS queue is not empty, process app message.
              if (events & SP_QUEUE_EVT)
              {
                while (!Queue_empty(appMsgQueueHandle))
                {
                  spEvt_t *pMsg = (spEvt_t *)Util_dequeueMsg(appMsgQueueHandle);
                  if (pMsg)
                  {
                    // Process message.
                    SimplePeripheral_processAppMsg(pMsg);

                    // Free the space from the message.
                    ICall_free(pMsg);
                  }
                }
              }
        }

        /***** Handles write to NVS and shut down protocols when user selects POWER OFF from MPB *****/
        if (!(*ptr_sp_POWER_ON)) // i.e. if power off
        {
            /*** If power off, the following actions are executed before shut down  ***/

            // if BLE is connected/linked -> terminate all connections
            if( (sp_opcode == GAP_LINK_ESTABLISHED_EVENT) || (sp_opcode == GAP_LINK_PARAM_UPDATE_EVENT) )
            {
            /* See https://dev.ti.com/tirex/explore/node?node=A__AfmOXSEGNa9-PneA2DxLYw__com.ti.SIMPLELINK_ACADEMY_CC13XX_CC26XX_SDK__AfkT0vQ__LATEST
             * reason option: see hci.h
             *    HCI_DISCONNECT_REMOTE_USER_TERM = HCI_ERROR_CODE_REMOTE_USER_TERM_CONN = 0x13
             */
                GAP_TerminateLinkReq(advHandleLegacy, HCI_DISCONNECT_REMOTE_USER_TERM);
            }

            for (;;)    // wait snvWrite FOR loop
            {
                if (*ptr_snvWriteFlag)   // remain in FOR loop until snvWriteFlag = 1
                {
                    check_snvWriteFlag++;   // for debugging purpose only
                    /****   write snv_internal_80 to snv    *******/
                    snv_status = osal_snv_write(SNV_NV_ID80, sizeof(snv_internal_80), &snv_internal_80);

                    *ptr_sp_POWER_ON = 1;   // for testing purposes only -> exit and set POWER_ON back to 1
                    break; // break out of wait snvWrite FOR loop
                }
            }

//            break;    // break out of main FOR loop

        }

    }   // FOR loop


}

/*********************************************************************
 * @fn      SimplePeripheral_processStackMsg
 *
 * @brief   Process an incoming stack message.
 *
 * @param   pMsg - message to process
 *
 * @return  TRUE if safe to deallocate incoming message, FALSE otherwise.
 */
static uint8_t SimplePeripheral_processStackMsg(ICall_Hdr *pMsg)
{
  // Always dealloc pMsg unless set otherwise
  uint8_t safeToDealloc = TRUE;

  BLE_LOG_INT_INT(0, BLE_LOG_MODULE_APP, "APP : Stack msg status=%d, event=0x%x\n", pMsg->status, pMsg->event);

  switch (pMsg->event)
  {
    case GAP_MSG_EVENT:
      SimplePeripheral_processGapMessage((gapEventHdr_t*) pMsg);
      break;

    case GATT_MSG_EVENT:
      // Process GATT message
      safeToDealloc = SimplePeripheral_processGATTMsg((gattMsgEvent_t *)pMsg);
      break;

    case HCI_GAP_EVENT_EVENT:
    {
      // Process HCI message
      switch(pMsg->status)
      {
        case HCI_COMMAND_COMPLETE_EVENT_CODE:
        // Process HCI Command Complete Events here
        {
          SimplePeripheral_processCmdCompleteEvt((hciEvt_CmdComplete_t *) pMsg);
          break;
        }

        case HCI_BLE_HARDWARE_ERROR_EVENT_CODE:
          AssertHandler(HAL_ASSERT_CAUSE_HARDWARE_ERROR,0);
          break;

        // HCI Commands Events
        case HCI_COMMAND_STATUS_EVENT_CODE:
        {
          hciEvt_CommandStatus_t *pMyMsg = (hciEvt_CommandStatus_t *)pMsg;
          switch ( pMyMsg->cmdOpcode )
          {
            case HCI_LE_SET_PHY:
            {
              SimplePeripheral_updatePHYStat(HCI_LE_SET_PHY, (uint8_t *)pMsg);
              break;
            }

            default:
              break;
          }
          break;
        }

        // LE Events
        case HCI_LE_EVENT_CODE:
        {
          hciEvt_BLEPhyUpdateComplete_t *pPUC =
            (hciEvt_BLEPhyUpdateComplete_t*) pMsg;

          // A Phy Update Has Completed or Failed
          if (pPUC->BLEEventCode == HCI_BLE_PHY_UPDATE_COMPLETE_EVENT)
          {
            SimplePeripheral_updatePHYStat(HCI_BLE_PHY_UPDATE_COMPLETE_EVENT, (uint8_t *)pMsg);
          }
          break;
        }

        default:
          break;
      }

      break;
    }

    default:
      // do nothing
      break;
  }

#ifdef PTM_MODE
  // Check for NPI Messages
  hciPacket_t *pBuf = (hciPacket_t *)pMsg;

  // Serialized HCI Event
  if (pBuf->hdr.event == HCI_CTRL_TO_HOST_EVENT)
  {
    uint16_t len = 0;

    // Determine the packet length
    switch(pBuf->pData[0])
    {
      case HCI_EVENT_PACKET:
        len = HCI_EVENT_MIN_LENGTH + pBuf->pData[2];
        break;

      case HCI_ACL_DATA_PACKET:
        len = HCI_DATA_MIN_LENGTH + BUILD_UINT16(pBuf->pData[3], pBuf->pData[4]);
        break;

      default:
        break;
    }

    // Send to Remote Host.
    simple_peripheral_sendToNPI(pBuf->pData, len);

    // Free buffers if needed.
    switch (pBuf->pData[0])
    {
      case HCI_ACL_DATA_PACKET:
      case HCI_SCO_DATA_PACKET:
        BM_free(pBuf->pData);
      default:
        break;
    }
  }
#endif // PTM_MODE

  return (safeToDealloc);
}

/*********************************************************************
 * @fn      SimplePeripheral_processGATTMsg
 *
 * @brief   Process GATT messages and events.
 *
 * @return  TRUE if safe to deallocate incoming message, FALSE otherwise.
 */
static uint8_t SimplePeripheral_processGATTMsg(gattMsgEvent_t *pMsg)
{
  // Free message payload. Needed only for ATT Protocol messages
  GATT_bm_free(&pMsg->msg, pMsg->method);

  // It's safe to free the incoming message
  return (TRUE);
}

/*********************************************************************
 * @fn      SimplePeripheral_processAppMsg
 *
 * @brief   Process an incoming callback from a profile.
 *
 * @param   pMsg - message to process
 *
 * @return  None.
 */
static void SimplePeripheral_processAppMsg(spEvt_t *pMsg)
{
  bool dealloc = TRUE;

  if (pMsg->event <= APP_EVT_EVENT_MAX)
  {
    BLE_LOG_INT_STR(0, BLE_LOG_MODULE_APP, "APP : App msg status=%d, event=%s\n", 0, appEventStrings[pMsg->event]);
  }
  else
  {
    BLE_LOG_INT_INT(0, BLE_LOG_MODULE_APP, "APP : App msg status=%d, event=0x%x\n", 0, pMsg->event);
  }

  switch (pMsg->event)
  {
    case SP_STATE_CHANGE_EVT:
//      SimplePeripheral_processStateChangeEvt((gaprole_States_t)pMsg->hdr.state);
    break;

