GenevGitHub/Genev_CC2652R7_Firmware/Application/simple_peripheral.c
      BLE_LOG_INT_TIME(0, BLE_LOG_MODULE_APP, "APP : ---- got GAP_LINK_ESTABLISHED_EVENT", 0);
      uint8_t numActive = linkDB_NumActive();

      if (pPkt->hdr.status == SUCCESS)
      {
        // Add connection to list and start RSSI
        SimplePeripheral_addConn(pPkt->connectionHandle);

        // Start Periodic Clock.
        Util_startClock(&clkPeriodic);
      }

      if ((numActive < MAX_NUM_BLE_CONNS) && (autoConnect == AUTOCONNECT_DISABLE))
      {
          // Start advertising since there is room for more connections
          check_enableStatus = GapAdv_enable(advHandleLegacy, GAP_ADV_ENABLE_OPTIONS_USE_DURATION , SP_ADVERTISING_TIMEOUT);//by_harry 2024_5_25
          //GapAdv_enable(advHandleLongRange, GAP_ADV_ENABLE_OPTIONS_USE_MAX , 0);//by_harry 2024_5_25
          *ptr_GAPflag = 0;  // whenever advertising is enabled, set GAPflag to 0

      }
      else
      {
          // Stop advertising since there is no room for more connections
//          GapAdv_disable(advHandleLongRange);
          GapAdv_disable(advHandleLegacy);
      }

      break;
    }

    case GAP_LINK_TERMINATED_EVENT:
    {
      gapTerminateLinkEvent_t *pPkt = (gapTerminateLinkEvent_t *)pMsg;
      sp_opcode = pPkt->opcode;

      // Display the amount of current connections
      uint8_t numActive = linkDB_NumActive();

      // Remove the connection from the list and disable RSSI if needed
      SimplePeripheral_removeConn(pPkt->connectionHandle);

      // If no active connections
      if (numActive == 0)
      {
        // Stop periodic clock
        Util_stopClock(&clkPeriodic);
      }

      BLE_LOG_INT_STR(0, BLE_LOG_MODULE_APP, "APP : GAP msg: status=%d, opcode=%s\n", 0, "GAP_LINK_TERMINATED_EVENT");
      // Start advertising since there is room for more connections

      /***** Disabled automatic advertising after disconnection with device  ****/
//      status = GapAdv_enable(advHandleLegacy, GAP_ADV_ENABLE_OPTIONS_USE_MAX , 0);
//      GapAdv_enable(advHandleLongRange, GAP_ADV_ENABLE_OPTIONS_USE_MAX , 0);
//      *ptr_GAPflag = 0;  // whenever advertising is enabled, set GAPflag to 0
//      check_enableStatus = status;

      break;
    }

    case GAP_UPDATE_LINK_PARAM_REQ_EVENT:
    {
      gapUpdateLinkParamReqReply_t rsp;

      gapUpdateLinkParamReqEvent_t *pReq = (gapUpdateLinkParamReqEvent_t *)pMsg;
      sp_opcode = pReq->opcode;  //https://software-dl.ti.com/simplelink/esd/simplelink_cc2640r2_sdk/4.20.00.04/exports/docs/blestack/ble_user_guide/doxygen/ble/html/group___g_a_p___event___i_ds.html#ga565d5dfa9c10e56bb5b3d768dcb7027c

      rsp.connectionHandle = pReq->req.connectionHandle;
      rsp.signalIdentifier = pReq->req.signalIdentifier;

      // Only accept connection intervals with peripheral latency of 0
      // This is just an example of how the application can send a response
      if(pReq->req.connLatency == 0)
      {
        rsp.intervalMin = pReq->req.intervalMin;
        rsp.intervalMax = pReq->req.intervalMax;
        rsp.connLatency = pReq->req.connLatency;
        rsp.connTimeout = pReq->req.connTimeout;
        rsp.accepted = TRUE;
      }
      else
      {
        rsp.accepted = FALSE;
      }

      // Send Reply
      VOID GAP_UpdateLinkParamReqReply(&rsp);

      break;
    }

    case GAP_LINK_PARAM_UPDATE_EVENT:
    {
      gapLinkUpdateEvent_t *pPkt = (gapLinkUpdateEvent_t *)pMsg;
      sp_opcode = pPkt->opcode;

      // Get the address from the connection handle
      linkDBInfo_t linkInfo;
      linkDB_GetInfo(pPkt->connectionHandle, &linkInfo);

      // Check if there are any queued parameter updates
      spConnHandleEntry_t *connHandleEntry = (spConnHandleEntry_t *)List_get(&paramUpdateList);
      if (connHandleEntry != NULL)
      {
        // Attempt to send queued update now
        SimplePeripheral_processParamUpdate(connHandleEntry->connHandle);

        // Free list element
        ICall_free(connHandleEntry);
      }

      break;
    }

#if defined ( NOTIFY_PARAM_UPDATE_RJCT )
    case GAP_LINK_PARAM_UPDATE_REJECT_EVENT:
    {
      linkDBInfo_t linkInfo;
      gapLinkUpdateEvent_t *pPkt = (gapLinkUpdateEvent_t *)pMsg;
      sp_opcode = pPkt->opcode;  // https://software-dl.ti.com/simplelink/esd/simplelink_cc2640r2_sdk/4.20.00.04/exports/docs/blestack/ble_user_guide/doxygen/ble/html/group___g_a_p___event___i_ds.html#ga565d5dfa9c10e56bb5b3d768dcb7027c

      // Get the address from the connection handle
      linkDB_GetInfo(pPkt->connectionHandle, &linkInfo);
      break;
    }
#endif

    default:
      break;
  }
}

/*********************************************************************
 * @fn      SimplePeripheral_charValueChangeCB
 *
 * @brief   Callback from Simple Profile indicating a characteristic
 *          value change.
 *
 * @param   paramId - parameter Id of the value that was changed.
 *
 * @return  None.
 */
static void SimplePeripheral_charValueChangeCB(uint8_t paramId)
{
  uint8_t *pValue = ICall_malloc(sizeof(uint8_t));

  if (pValue)
  {
    *pValue = paramId;

    if (SimplePeripheral_enqueueMsg(SP_CHAR_CHANGE_EVT, pValue) != SUCCESS)
    {
      ICall_free(pValue);
    }
  }
}

/*********************************************************************
 * @fn      SimplePeripheral_dashboardCB
 *
 * @brief   When the client (The mobile app) writes the Dashboard GATT server
 *          It will post the paramID of the changed characteristic, and Set the gatt due to client Callback
 *
 *          G-Link v1 allows the following characteristics to be changed from the client (mobile app)
 *          - light mode (paramID 3)
 *
 * @param   paramID: the paramID of the characteristics
 *
 * @return  TRUE or FALSE
 */
static void SimplePeripheral_dashboardCB(uint8_t paramID)
{
    switch(paramID)
    {
    case DASHBOARD_LIGHT_MODE: // whenever user tabs the light mode icon on the mobile app, SimplePeripheral_dashboardCB will toggle the light mode by calling lightControl_change()
        {
            led_display_setLightMode( lights_lightModeChange() );               // set and update the light mode indicator on dashboard
            break;
        }
    default:
        break;
    }
}

static void SimplePeripheral_batteryCB(uint8_t paramID)
{
    /***  Currently no call back from battery profile  ****/
}

static void SimplePeripheral_controllerCB(uint8_t paramID)
{
    /***  Currently no call back from controller profile  ****/

