GenevGitHub/Genev_CC2652R7_Firmware/Application/simple_peripheral.c
}
/*********************************************************************
 * @fn      SimplePeripheral_processCharValueChangeEvt
 *
 * @brief   Process a pending Simple Profile characteristic value change
 *          event.
 *
 * @param   paramID - parameter ID of the value that was changed.
 */
static void SimplePeripheral_processCharValueChangeEvt(uint8_t paramId)
{
  uint8_t newValue;

  /*********************************************************************
   *                 For Write Permit
   *
   *    Whenever the client receives an input from the user, a callback
   *    is executed.  GetParameter() retrieves the value/data, that
   *    allow us to do something with it
   *
   **********************************************************************/
  switch(paramId)
  {
      /* Whenever a new value is written to DASHBOARD LIGHT MODE on the APP
       * this processCharValueChangeEvt reads the new value on the App */
    case DASHBOARD_LIGHT_MODE:
      Dashboard_GetParameter(DASHBOARD_LIGHT_MODE, &newValue);

      break;

    default:
      // should not reach here!
      break;
  }
}

/*********************************************************************
 * @fn      SimplePeripheral_performPeriodicTask
 *
 * @brief   Perform a periodic application task. This function gets called
 *          every five seconds (SP_PERIODIC_EVT_PERIOD). In this example,
 *          the value of the third characteristic in the SimpleGATTProfile
 *          service is retrieved from the profile, and then copied into the
 *          value of the the fourth characteristic.
 *
 * @param   None.
 *
 * @return  None.
 */
static void SimplePeripheral_performPeriodicTask(void)
{
  uint8_t valueToCopy;
  uint8_t arrayToCopy1[1];
  uint8_t arrayToCopy2[2];
  uint8_t arrayToCopy4[4];

  /****************************************************************
   *                 For Notify Permit
   ****************************************************************/

  /******** Simple Peripheral Notification **********/

  /******** Dashboard Profile Notification **********/
  if (Dashboard_GetParameter(DASHBOARD_SPEED_MODE, arrayToCopy1) == SUCCESS)
  {
    Dashboard_SetParameter(DASHBOARD_SPEED_MODE, DASHBOARD_SPEED_MODE_LEN, arrayToCopy1);
  }

  if (Dashboard_GetParameter(DASHBOARD_LIGHT_STATUS, arrayToCopy1) == SUCCESS)
  {
    Dashboard_SetParameter(DASHBOARD_LIGHT_STATUS, DASHBOARD_LIGHT_STATUS_LEN, arrayToCopy1);
  }

  if (Dashboard_GetParameter(DASHBOARD_LIGHT_MODE, arrayToCopy1) == SUCCESS)
  {
    Dashboard_SetParameter(DASHBOARD_LIGHT_MODE, DASHBOARD_LIGHT_MODE_LEN, arrayToCopy1);
  }

  if (Dashboard_GetParameter(DASHBOARD_POWER_ON_TIME, arrayToCopy2) == SUCCESS)
    {
    /* Call to set that value of DASHBOARD_POWER_ON_TIME in the profile.
     * Note that if notifications of the DASHBOARD_POWER_ON_TIME have been
     * enabled by a GATT client device, then a notification will be sent
     * every time this function is called. */
      Dashboard_SetParameter(DASHBOARD_POWER_ON_TIME, DASHBOARD_POWER_ON_TIME_LEN, arrayToCopy2);
    }

  if (Dashboard_GetParameter(DASHBOARD_ADCOUNTER, arrayToCopy4) == SUCCESS)
    {
      Dashboard_SetParameter(DASHBOARD_ADCOUNTER, DASHBOARD_ADCOUNTER_LEN, arrayToCopy4);
    }

  /******** Battery Profile Notification **********/
  if (Battery_GetParameter(BATTERY_BATTERY_LEVEL, arrayToCopy1) == SUCCESS)
    {
      Battery_SetParameter(BATTERY_BATTERY_LEVEL, BATTERY_BATTERY_LEVEL_LEN, arrayToCopy1);
    }

  if (Battery_GetParameter(BATTERY_BATTERY_VOLTAGE, arrayToCopy2) == SUCCESS)
    {
      Battery_SetParameter(BATTERY_BATTERY_VOLTAGE, BATTERY_BATTERY_VOLTAGE_LEN, arrayToCopy2);
    }

  if (Battery_GetParameter(BATTERY_BATTERY_TEMPERATURE, arrayToCopy1) == SUCCESS)
    {
      Battery_SetParameter(BATTERY_BATTERY_TEMPERATURE, BATTERY_BATTERY_TEMPERATURE_LEN, arrayToCopy1);
    }

  if (Battery_GetParameter(BATTERY_BATTERY_ERROR_CODE, arrayToCopy1) == SUCCESS)
    {
      Battery_SetParameter(BATTERY_BATTERY_ERROR_CODE, BATTERY_BATTERY_ERROR_CODE_LEN, arrayToCopy1);
    }

  if (Battery_GetParameter(BATTERY_BATTERY_STATUS, arrayToCopy1) == SUCCESS)
    {
      Battery_SetParameter(BATTERY_BATTERY_STATUS, BATTERY_BATTERY_STATUS_LEN, arrayToCopy1);
    }

//  if (Battery_GetParameter(BATTERY_BATTERY_CURRENT, arrayToCopy2) == SUCCESS)
//    {
//      Battery_SetParameter(BATTERY_BATTERY_CURRENT, BATTERY_BATTERY_CURRENT_LEN, arrayToCopy2);
//    }

  /******** Controller Profile Notification **********/
  if (Controller_GetParameter(CONTROLLER_VOLTAGE, arrayToCopy2) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_VOLTAGE, CONTROLLER_VOLTAGE_LEN, arrayToCopy2);
    }

  if (Controller_GetParameter(CONTROLLER_CURRENT, arrayToCopy2) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_CURRENT, CONTROLLER_CURRENT_LEN, arrayToCopy2);
    }

  if (Controller_GetParameter(CONTROLLER_HEAT_SINK_TEMPERATURE, arrayToCopy1) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_HEAT_SINK_TEMPERATURE, CONTROLLER_HEAT_SINK_TEMPERATURE_LEN, arrayToCopy1);
    }

  if (Controller_GetParameter(CONTROLLER_ERROR_CODE, arrayToCopy1) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_ERROR_CODE, CONTROLLER_ERROR_CODE_LEN, arrayToCopy1);
    }

  if (Controller_GetParameter(CONTROLLER_MOTOR_RPM, arrayToCopy2) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_MOTOR_RPM, CONTROLLER_MOTOR_RPM_LEN, arrayToCopy2);
    }

  if (Controller_GetParameter(CONTROLLER_MOTOR_SPEED, arrayToCopy2) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_MOTOR_SPEED, CONTROLLER_MOTOR_SPEED_LEN, arrayToCopy2);
    }

  if (Controller_GetParameter(CONTROLLER_TOTAL_DISTANCE_TRAVELLED, arrayToCopy4) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_TOTAL_DISTANCE_TRAVELLED, CONTROLLER_TOTAL_DISTANCE_TRAVELLED_LEN, arrayToCopy4);
    }

  if (Controller_GetParameter(CONTROLLER_TOTAL_ENERGY_CONSUMPTION, arrayToCopy4) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_TOTAL_ENERGY_CONSUMPTION, CONTROLLER_TOTAL_ENERGY_CONSUMPTION_LEN, arrayToCopy4);
    }

