GenevGitHub/Genev_CC2652R7_Firmware/Application/simple_peripheral.c
  if (Controller_GetParameter(CONTROLLER_OVERALL_EFFICIENCY, arrayToCopy4) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_OVERALL_EFFICIENCY, CONTROLLER_OVERALL_EFFICIENCY_LEN, arrayToCopy4);
    }

  if (Controller_GetParameter(CONTROLLER_RANGE, arrayToCopy4) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_RANGE, CONTROLLER_RANGE_LEN, arrayToCopy4);
    }

  if (Controller_GetParameter(CONTROLLER_CO2SAVED, arrayToCopy4) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_CO2SAVED, CONTROLLER_CO2SAVED_LEN, arrayToCopy4);
    }

  if (Controller_GetParameter(CONTROLLER_INSTANT_ECONOMY, arrayToCopy2) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_INSTANT_ECONOMY, CONTROLLER_INSTANT_ECONOMY_LEN, arrayToCopy2);
    }

  if (Controller_GetParameter(CONTROLLER_MOTOR_TEMPERATURE, arrayToCopy1) == SUCCESS)
    {
      Controller_SetParameter(CONTROLLER_MOTOR_TEMPERATURE, CONTROLLER_MOTOR_TEMPERATURE_LEN, arrayToCopy1);
    }

}

/*********************************************************************
 * @fn      SimplePeripheral_updateRPA
 *
 * @brief   Read the current RPA from the stack
 *          if the RPA has changed.
 *
 * @param   None.
 *
 * @return  None.
 */
static void SimplePeripheral_updateRPA(void)
{
  uint8_t* pRpaNew;

  // Read the current RPA.
  pRpaNew = GAP_GetDevAddress(FALSE);

  if (memcmp(pRpaNew, rpa, B_ADDR_LEN))
  {
    memcpy(rpa, pRpaNew, B_ADDR_LEN);
  }
}

/*********************************************************************
 * @fn      SimplePeripheral_clockHandler
 *
 * @brief   Handler function for clock timeouts.
 *
 * @param   arg - event type
 *
 * @return  None.
 */
static void SimplePeripheral_clockHandler(UArg arg)
{
  spClockEventData_t *pData = (spClockEventData_t *)arg;

 if (pData->event == SP_PERIODIC_EVT)
 {
   // Start the next period
   Util_startClock(&clkPeriodic);

   // Post event to wake up the application
   SimplePeripheral_enqueueMsg(SP_PERIODIC_EVT, NULL);
 }
 else if (pData->event == SP_READ_RPA_EVT)
 {
   // Start the next period
   Util_startClock(&clkRpaRead);

   // Post event to read the current RPA
   SimplePeripheral_enqueueMsg(SP_READ_RPA_EVT, NULL);
 }
 else if (pData->event == SP_SEND_PARAM_UPDATE_EVT)
 {
    // Send message to app
    SimplePeripheral_enqueueMsg(SP_SEND_PARAM_UPDATE_EVT, pData);
 }
}

/*********************************************************************
 * @fn      SimplePeripheral_doSetConnPhy
 *
 * @brief   Set PHY preference.
 *
 * @param   index - 0: 1M PHY
 *                  1: 2M PHY
 *                  2: 1M + 2M PHY
 *                  3: CODED PHY (Long range)
 *                  4: 1M + 2M + CODED PHY
 *
 * @return  always true
 */
bool SimplePeripheral_doSetConnPhy(uint8 index)
{
  bool status = TRUE;

  static uint8_t phy[] = {
    HCI_PHY_1_MBPS, HCI_PHY_2_MBPS, HCI_PHY_1_MBPS | HCI_PHY_2_MBPS,
    HCI_PHY_CODED, HCI_PHY_1_MBPS | HCI_PHY_2_MBPS | HCI_PHY_CODED,
    AUTO_PHY_UPDATE
  };

  uint8_t connIndex = SimplePeripheral_getConnIndex(menuConnHandle);
  if (connIndex >= MAX_NUM_BLE_CONNS)
  {
    return FALSE;
  }

  // Set Phy Preference on the current connection. Apply the same value
  // for RX and TX.
  // If auto PHY update is not selected and if auto PHY update is enabled, then
  // stop auto PHY update
  // Note PHYs are already enabled by default in build_config.opt in stack project.
  if(phy[index] != AUTO_PHY_UPDATE)
  {
    // Cancel RSSI reading  and auto phy changing
    SimplePeripheral_stopAutoPhyChange(connList[connIndex].connHandle);

    SimplePeripheral_setPhy(menuConnHandle, 0, phy[index], phy[index], 0);

  }
  else
  {
    // Start RSSI read for auto PHY update (if it is disabled)
    SimplePeripheral_startAutoPhyChange(menuConnHandle);
  }

  return status;
}
/*********************************************************************
 * @fn      SimplePeripheral_advCallback
 *
 * @brief   GapAdv module callback
 *
 * @param   pMsg - message to process
 */
static void SimplePeripheral_advCallback(uint32_t event, void *pBuf, uintptr_t arg)
{
  spGapAdvEventData_t *pData = ICall_malloc(sizeof(spGapAdvEventData_t));

  if (pData)
  {
    pData->event = event;
    pData->pBuf = pBuf;

    if(SimplePeripheral_enqueueMsg(SP_ADV_EVT, pData) != SUCCESS)
    {
      ICall_free(pData);
    }
  }
}

/*********************************************************************
 * @fn      SimplePeripheral_processAdvEvent
 *
 * @brief   Process advertising event in app context
 *
 * @param   pEventData
 */
//uint8_t GAPAdv_status = 0xFF;   // debugging only
//uint32_t GAPAdvEvent;           // debugging only

static void SimplePeripheral_processAdvEvent(spGapAdvEventData_t *pEventData)
{
//    GAPAdvEvent = pEventData->event;

  switch (pEventData->event)
  {
    case GAP_EVT_ADV_START_AFTER_ENABLE:
      BLE_LOG_INT_TIME(0, BLE_LOG_MODULE_APP, "APP : ---- GAP_EVT_ADV_START_AFTER_ENABLE", 0);
//          GAPAdv_status = 0x01;
          sp_advertiseFlag = 1;
      break;

    case GAP_EVT_ADV_END_AFTER_DISABLE:
//        GAPAdv_status = 0x02;
        sp_advertiseFlag = 0;
      break;

    case GAP_EVT_ADV_START:
//        GAPAdv_status = 0x03;
        sp_advertiseFlag = 1;
      break;

    case GAP_EVT_ADV_END:
//        GAPAdv_status = 0x04;
        sp_advertiseFlag = 0;
      break;

    case GAP_EVT_ADV_SET_TERMINATED:
//        GAPAdv_status = 0x05;
        sp_advertiseFlag = 0;
    break;

    case GAP_EVT_SCAN_REQ_RECEIVED:
//        GAPAdv_status = 0x06;
      break;

    case GAP_EVT_INSUFFICIENT_MEMORY:
//        GAPAdv_status = 0x07;
      break;

    default:
      break;
  }

  // All events have associated memory to free except the insufficient memory
  // event
  if (pEventData->event != GAP_EVT_INSUFFICIENT_MEMORY)
  {
    ICall_free(pEventData->pBuf);
  }
}


/*********************************************************************
 * @fn      SimplePeripheral_pairStateCb
 *
 * @brief   Pairing state callback.
 *
 * @return  none
 */
static void SimplePeripheral_pairStateCb(uint16_t connHandle, uint8_t state,
                                         uint8_t status)
{
  spPairStateData_t *pData = ICall_malloc(sizeof(spPairStateData_t));

  // Allocate space for the event data.
  if (pData)
  {
    pData->state = state;
    pData->connHandle = connHandle;
    pData->status = status;

